from tkinter import *
import tkinter as tk

def main():
    window = tk.Tk()
    window.title("巧克力DISCO")
    window.geometry("+{}+{}".format(600, 600))
    mainFrame = Frame(window, width=600, height=600)
    mainFrame.pack()

    e = tk.Entry(window, show = None,width=50, bd=1,relief="groove")
    e.pack()

    t = tk.Text(window, height=5)
    t.pack()

    def chg():
        text =e.get()
    
        dic = {"不要":"莫","这么":"楞个","这":"嘞","为什么":"啷个","这里":"嘞点儿",'蜻蜓': '丁丁猫儿','蚯蚓': '渠算儿','蚱蜢': '爪母儿', '跳蚤': '格蚤儿', '知了': '金啊子', '青蛙': '瞎块儿',"蛔虫":"巢冲","蟑螂":"偷油婆","小鸟":"雀雀儿","蛐蛐儿":"照鸡儿","高" :"高耸耸","脏":"烦造造","短":"短处处","少":"低低噶噶儿","野":"飞叉叉","大惊小怪":"惊抓抓","糊涂":"矿希希","直":"琛","发神经":"神戳戳","胳肢窝":"瞎孔","不动了":"不扭老","不动":"不扭","了":"老","胡侃":"吹跨跨","聊天":"摆龙门阵","摔跤":"达扑爬","敲头":"kao ko zhuan儿","紧挨":"巴到","夹菜":"拈菜","打呼噜":"扯扑汗","挠痒痒":"哈迹跟儿","脚崴了":"脚入老","吸":"菊","试一下":"告哈儿","丢失":"搞舌","伸":"痴","跺":"读","掰":"咩","过滤":"壁","估计":"俺到","相抵":"怼","踢":"爪","假装":"假巴意思","撒尿":"屙尿","拉屎":"屙屎","很":"嘿","热闹":"闹热","我":"老子","傻":"哈","什么":"啥子","闲逛":"灯儿晃","发呆":"打王逛","吗":"迈？","吧":"噻","瞎子":"爆眼","就是":"斗是","对":"对头","吓人":"嘿人","搭讪":"搭飞白","鞋":"hai子","盖上":"kang","削笔刀":"车笔刀","嗓子难受":"哈喉","责备":"里抹","幸好":"西得好","滑梯":"索索摊儿","排队":"排轮子","脑袋":"脑壳","膝盖":"克西头儿","手肘":"手倒管儿","长辈":"老辈子","方便":"撇脱","便宜":"相因","轻松":"松活","把握":"哈数","强迫":"鼓到","撒谎":"扯把子","有矛盾":"过孽","满意":"匀尽","厕所":"茅丝","悄悄地":"悄悄咪咪嘞","悄悄":"阴到","倒霉":"闯鬼了","走人户":"串门","麻烦":"老火","该背时":"活该","调皮":"千帆儿","缠人":"扭到","拳头":"定子","开腔":"说话","阴阳怪气":"踏削","胡言乱语":"打胡乱说","行为乖张":"怪谜日眼","迷迷糊糊":"醒儿活塞","不切实际":"想精想怪","困":"瞌睡谜西","小气":"财迷火眼","无聊":"磨皮擦痒","不稳重":"吊儿锒铛","狼吞虎咽":"饿龙饿虾","厚脸皮":"玄皮寡脸","认真":"正儿八经","加油":"雄起"}

        for k,v in dic.items(): 
            text= text.replace(k,v)
    
        t.insert("insert",text)
    
    okButton =  Button(mainFrame, text="变", command=chg)
    okButton.pack(padx=100, pady=(20,5))
    window.mainloop()

if __name__ == "__main__":
    main()